Documents/ВедомостьНаВозвратПрочихВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВедомостьНаВозвратПрочихВыплат</Name>
			<BasedOn>
				<xr:Item>Document.ВедомостьНаПеречислениеПрочихВыплат</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоПрочимВыплатам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПрочихВыплат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихВыплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаПеречислениеПрочихВыплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрочиеВыплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыПоПрочимВыплатам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыПоПрочимВыплатам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПрочихВыплат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихВыплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВедомостьНаПеречислениеПрочихВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВедомостьНаПеречислениеПрочихВыплат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоПрочимВыплатам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПрочихВыплат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихВыплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаСуммКПеречислению</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаполненияСуммКПеречислениюНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьГлавногоБухгалтера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиГлавногоБухгалтера</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрочиеВыплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВедомостьНаВозвратПрочихВыплат/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура") 
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Номер");
		ЗаполнитьПоДокументуОснования(ДанныеЗаполнения);
		ДокументОснование = ДанныеЗаполнения;
	ИначеЕсли ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;

	Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = ПрочиеВыплаты.Итог("Сумма");

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДатаВозврата");	
	
	КонецЕсли;
	
	ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация, Подразделение, ВидПрочихВыплат");
	
	ШаблонТекстОшибки = НСтр("ru = 'В документе перечисления выплаты %1 отличается значение поля %2'");
	
	Если НЕ ДанныеДокументаОснования.Организация = Организация Тогда 
        ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстОшибки, ДокументОснование, НСтр("ru = 'Организация'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОснование, , , Отказ);
	КонецЕсли;
	
	Если НЕ ДанныеДокументаОснования.Подразделение = Подразделение Тогда 
        ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстОшибки, ДокументОснование, НСтр("ru = 'Подразделение'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОснование, , , Отказ);
	КонецЕсли;
	
	Если НЕ ДанныеДокументаОснования.ВидПрочихВыплат = ВидПрочихВыплат Тогда 
        ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстОшибки, ДокументОснование, НСтр("ru = 'Вид прочей выплаты'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОснование, , , Отказ);
	КонецЕсли;
	
	ПроверитьПересечениеФизическихЛиц(Отказ);
	ПроверитьФизическихЛицДокументаОснования(Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// движение в документах поступления ДС
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда
		Возврат;	
	КонецЕсли;
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПараметрыПроведения = Документы.ВедомостьНаВозвратПрочихВыплат.ПодготовитьПараметрыПроведения(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ВзаиморасчетыПоПрочимВыплатам.Записывать = Истина;
	Движения.ВзаиморасчетыПоПрочимВыплатам.Загрузить(ПараметрыПроведения.ДанныеПрочихВыплат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет заполнение документа по документу-основанию
//
Процедура ЗаполнитьПоДокументуОснования(Основание) Экспорт
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВедомостьНаПеречислениеПрочихВыплат") Тогда

		Документы.ВедомостьНаВозвратПрочихВыплат.ЗаполнитьПоВедомостьНаПеречислениеПрочихВыплат(ЭтотОбъект, Основание);
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьПересечениеФизическихЛиц(Отказ) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка",  			Ссылка);
	Запрос.УстановитьПараметр("ПрочиеВыплаты", 		ПрочиеВыплаты);
	Запрос.УстановитьПараметр("ДокументОснование",  ДокументОснование);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрочиеВыплаты.НомерСтроки КАК НомерСтроки,
	|	ПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов
	|ПОМЕСТИТЬ ВТ_ПрочиеВыплаты
	|ИЗ
	|	&ПрочиеВыплаты КАК ПрочиеВыплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВедомостьНаВозвратПрочихВыплат.Ссылка КАК Ссылка,
	|	ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_СведенияОНезачисленныхПрочихВыплатах
	|ИЗ
	|	Документ.ВедомостьНаВозвратПрочихВыплат КАК ВедомостьНаВозвратПрочихВыплат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВозвратПрочихВыплат.ПрочиеВыплаты КАК ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты
	|		ПО ВедомостьНаВозвратПрочихВыплат.Ссылка = ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.Ссылка
	|ГДЕ
	|	НЕ ВедомостьНаВозвратПрочихВыплат.Ссылка = &Ссылка
	|	И ВедомостьНаВозвратПрочихВыплат.ДокументОснование = &ДокументОснование
	|	И ВедомостьНаВозвратПрочихВыплат.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПрочиеВыплаты.НомерСтроки КАК НомерСтроки,
	|	ПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	СведенияОНезачисленныхПрочихВыплатах.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ПрочиеВыплаты КАК ПрочиеВыплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияОНезачисленныхПрочихВыплатах КАК СведенияОНезачисленныхПрочихВыплатах
	|		ПО (СведенияОНезачисленныхПрочихВыплатах.ФизическоеЛицо = ПрочиеВыплаты.ФизическоеЛицо)
	|			И (СведенияОНезачисленныхПрочихВыплатах.ПериодВзаиморасчетов = ПрочиеВыплаты.ПериодВзаиморасчетов)
	|ГДЕ
	|	НЕ СведенияОНезачисленныхПрочихВыплатах.Ссылка ЕСТЬ NULL";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru='Физическое лицо %1 в строке %2 уже включен в ведомость на возврат %3 за период %4'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.ФизическоеЛицо, Выборка.НомерСтроки, Выборка.Ссылка, Выборка.ПериодВзаиморасчетов);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьФизическихЛицДокументаОснования(Отказ) Экспорт
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ПрочиеВыплаты", 		ПрочиеВыплаты);
	Запрос.УстановитьПараметр("ДокументОснование",  ДокументОснование);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрочиеВыплаты.НомерСтроки КАК НомерСтроки,
	|	ПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов
	|ПОМЕСТИТЬ ВТ_ПрочиеВыплаты
	|ИЗ
	|	&ПрочиеВыплаты КАК ПрочиеВыплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВедомостьНаПеречислениеПрочихВыплат.Ссылка КАК Ссылка,
	|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ВедомостьНаПеречислениеПрочихВыплат
	|ИЗ
	|	Документ.ВедомостьНаПеречислениеПрочихВыплат КАК ВедомостьНаПеречислениеПрочихВыплат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеПрочихВыплат.ПрочиеВыплаты КАК ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты
	|		ПО ВедомостьНаПеречислениеПрочихВыплат.Ссылка = ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка
	|ГДЕ
	|	ВедомостьНаПеречислениеПрочихВыплат.Ссылка = &ДокументОснование
	|	И ВедомостьНаПеречислениеПрочихВыплат.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПрочиеВыплаты.НомерСтроки КАК НомерСтроки,
	|	ПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВедомостьНаПеречислениеПрочихВыплат.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ПрочиеВыплаты КАК ПрочиеВыплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВедомостьНаПеречислениеПрочихВыплат КАК ВедомостьНаПеречислениеПрочихВыплат
	|		ПО (ВедомостьНаПеречислениеПрочихВыплат.ФизическоеЛицо = ПрочиеВыплаты.ФизическоеЛицо)
	|			И (ВедомостьНаПеречислениеПрочихВыплат.ПериодВзаиморасчетов = ПрочиеВыплаты.ПериодВзаиморасчетов)
	|ГДЕ
	|	ВедомостьНаПеречислениеПрочихВыплат.Ссылка ЕСТЬ NULL";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru='Физическое лицо %1 в строке %2 не включено в ведомость на перечисление %3 за период %4'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.ФизическоеЛицо, Выборка.НомерСтроки, ДокументОснование, Выборка.ПериодВзаиморасчетов);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументОснование);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
